{
  "tech": [
    {
      "key": "security",
      "title": "🛡️ Security & Authentication",
      "details": [
        "Applies a <strong>security-first mindset</strong> and the <strong>Principle of Least Privilege (PoLP)</strong>.",
        "Implements <strong>OWASP Top 10</strong> best practices to prevent SQL Injection, XSS, SSRF and CSRF attacks.",
        "Performs regular <strong>Fortify</strong> scans and code reviews to detect and fix security vulnerabilities.",
        "Integrated <strong>AWS Cognito</strong> for user authentication and authorisation, sign-up flows and multi-factor authentication (MFA).",
        "Implements <strong>JWT-based authentication</strong> between <strong>React</strong> frontend and <strong>Node.js</strong> backend with token validation and refresh.",
        "Uses <strong>role-based access control (RBAC)</strong> to restrict user permissions based on roles and responsibilities."
      ]
    },
    {
      "key": "frontend",
      "title": "🎨 Frontend, Design & Accessibility",
      "details": [
        "Builds modern, component-driven UIs with <strong>React</strong> and <strong>TypeScript</strong>.",
        "Creates reusable modular components to maintain a clean and efficient codebase.",
        "Applies consistent design with <strong>Styled Components</strong> and shared design tokens for colour, typography and spacing.",
        "Ensures responsive layouts with CSS media queries across all devices.",
        "Collaborates closely with designers in <strong>Figma</strong> for seamless design-to-code workflows.",
        "Exceeds <strong>WCAG 2.2</strong> standards through inclusive design, supporting neurodiverse and assistive-technology users."
      ]
    },
    {
      "key": "backend",
      "title": "🏛️ Backend & Architecture",
      "details": [
        "Designs scalable, modular architectures using <strong>Node.js</strong>, <strong>React</strong> and <strong>PostgreSQL</strong>.",
        "Develops <strong>RESTful APIs</strong> with <strong>Express</strong> to handle data requests and backend logic.",
        "Builds <strong>Node.js background workers</strong> to consume <strong>AWS SQS queues</strong> for AI content generation and notifications.",
        "Documents architecture diagrams to clarify component interactions and data flow.",
        "Applies proven design principles and patterns to ensure maintainable and testable code."
      ]
    },
    {
      "key": "devops",
      "title": "☁️ Cloud DevOps, AI & Integrations",
      "details": [
        "Deploys <strong>AWS cloud infrastructure</strong> with <strong>Terraform</strong> code-to-infrastructure implementation.",
        "Builds <strong>CI/CD pipelines</strong> with <strong>GitHub Actions</strong> for automated, multi-environment deployments.",
        "Manages AWS infrastructure components, including CloudFront, Elastic Beanstalk, ECS and RDS.",
        "Uses <strong>Docker</strong> for containerised microservices to ensure consistent environments.",
        "Integrates <strong>AWS cloud AI services</strong> and <strong>OpenAI APIs</strong> to automate course creation and content generation.",
        "Integrated <strong>AWS Polly</strong> to generate audio transcripts and <strong>OpenAI</strong> for video transcripts.",
        "Integrated <strong>Stripe API</strong> to take payments."
      ]
    },
    {
      "key": "testing_performance",
      "title": "🧪 Testing & Performance",
      "details": [
        "Champions testing and performance, ensuring software responsiveness and stability.",
        "Writes end-to-end <strong>Playwright</strong> tests to simulate key user journeys across <strong>React</strong>, <strong>Node.js</strong> and <strong>PostgreSQL</strong>.",
        "Integrates <strong>Playwright</strong> into <strong>GitHub Actions</strong> CI/CD pipelines, gating deployments on test success.",
        "Writes <strong>Jest</strong> unit tests to ensure bug-free functionality.",
        "Optimises frontend performance using <strong>React Context</strong>, memoization and efficient data fetching and state management.",
        "Improves <strong>PostgreSQL</strong> database query speed with indexes for frequently accessed data."
      ]
    },
    {
      "key": "ai_ml",
      "title": "🤖 Data Science & Machine Learning",
      "details": [
        "Builds <strong>machine learning models</strong> with <strong>Python</strong> and <strong>Pandas</strong> to generate data-driven insights.",
        "Built a model to identify learning preferences by clustering behavioural and performance data for personalised learning.",
        "Explores <strong>Neo4j</strong> graph databases with <strong>Cypher</strong> and <strong>D3.js</strong> for knowledge graph visualisation."
      ]
    }
  ],
  "soft": [
    {
      "key": "leader",
      "title": "🧭 Leader & Mentor",
      "details": [
        "Leads development teams with technical guidance and mentorship.",
        "Champions agile development and chairs ceremonies: stand-ups, retrospectives and demos.",
        "Plans roadmaps and sprints to organise and delegate work.",
        "Leads by example by taking ownership of complex feature development and deployments.",
        "Fosters a psychologically safe and rewarding culture to encourage innovation and ownership.",
        "Mentors developers via code reviews, workshops and documentation to improve team capability and consistency."
      ]
    },
    {
      "key": "strategist",
      "title": "🧩 Strategist & Problem Solver",
      "details": [
        "Thinks strategically about software design, aligning technical decisions with long-term business goals.",
        "Delivers complex, high-impact solutions efficiently under tight deadlines and low-resource environments.",
        "Responds rapidly to production issues, restoring stability while addressing root causes.",
        "Makes informed, timely decisions, prioritising high-impact work and taking ownership of outcomes.",
        "Identifies risks proactively and implements mitigations."
      ]
    },
    {
      "key": "teamwork",
      "title": "🤝 Teamwork & Communication",
      "details": [
        "Builds trust and rapport with transparency, reliability and engagement.",
        "Engages professionally with internal and external teams to deliver cohesive software solutions.",
        "Explains complex technical concepts clearly to both technical and non-technical stakeholders.",
        "Considers everyone's input before directing the team with collaborative decision-making.",
        "Promotes transparency by documenting processes, pipelines and architectural decisions."
      ]
    },
    {
      "key": "innovation",
      "title": "🧠 Innovation & Continuous Learning",
      "details": [
        "Innovates by contributing original ideas, shaping product direction and leading technical strategy.",
        "Evaluates emerging technologies and demonstrates proof-of-concepts to modernise the software product.",
        "Expands expertise across software engineering, cloud services and AI, translating insights into practical solutions.",
        "Fosters a culture of continuous learning, encouraging knowledge sharing and critical thinking."
      ]
    }
  ]
}
